cases/GE_3x3/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version    2.0;
    format     ascii;
    class      volScalarField;
    object     p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions           [1 -1 -2 0 0 0 0];

internalField        uniform 0;

boundaryField
{
    INLET
    {
        type        zeroGradient;
    }

    OUTLET
    {
        type         fixedValue;
        value        uniform 0;
    }

    WALL
    {
        type        zeroGradient;
    }
}

// ************************************************************************* //


