cases/GE_3x3/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication $application


# ----------------------------------------------------------------- end-of-file


