cases/GE_3x3/constant/ReactorCore
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ReactorCore;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CoreMapDimension               15;

CenterAssemblyXIndex           8;

CenterAssemblyYIndex           8;

AssemblyWidth                  0.05883;

pitch                          0.018743;

CorrectRodArrangement          yes;

TestCaseWithAssemblyBox        yes;

AssemblyBoxCornerRadius        0.01016;

AssemblyRodsDimension          3;

RodOuterDiameter               0.01448;

MixingCoefficient              0.0035;


Core_type_z_direction
1
(1);


Core_height_z_direction
1
(2.00);


CoreAssemblyDistribution
15
(
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  1  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
);


CoreAssemblyPowerDistributionFactor
15
(
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  1.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
);


AssemblyRodLayout
3
(
3( 1  1  1 )
3( 1  1  1 )
3( 1  1  1 )
);


RodPinPowerDistributionFactor
3
(
3( 1.000  1.000  1.000 )
3( 1.000  1.000  1.000 )
3( 1.000  1.000  1.000 )
);


// ************************************************************************* //


