cases/GE_3x3/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    ( -0.0294  -0.0294   0.0000 )
    ( -0.0294   0.0294   0.0000 )
    (  0.0294   0.0294   0.0000 )
    (  0.0294  -0.0294   0.0000 )


    ( -0.0294  -0.0294   1.8300 )
    ( -0.0294   0.0294   1.8300 )
    (  0.0294   0.0294   1.8300 )
    (  0.0294  -0.0294   1.8300 )
);

blocks
(
        hex (    0   3   2   1   4   7   6   5)   (  4  4  40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    OUTLET
    {
        type wall;
        faces
        (
            (   7   6   5   4 )
        );
    }
    INLET
    {
        type wall;
        faces
        (
            (   0   1   2   3 )
        );
    }
    WALL
    {
        type wall;
        faces
        (
            (   0   4   5   1 )
            (   1   5   6   2 )
            (   2   6   7   3 )
            (   3   7   4   0 )
        );
    }
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


