cases/GE_3x3/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  subChannelFoam                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type                   heRhoThermo;
    mixture                pureMixture;
    transport              polynomial;
    thermo                 hPolynomial;
    equationOfState        icoPolynomial;
    specie                 specie;
    energy                 sensibleEnthalpy;
}

mixture
{
    // coefficients for water

    specie
    {
        nMoles           1;
        molWeight        18;
    }

    equationOfState
    {
        rhoCoeffs<8>        ( 1000.0  0  0  0  0  0  0  0 );
    }

    thermodynamics
    {
        Hf                 0;
        Sf                 0;
        CpCoeffs<8>        ( 4162.8  0  0  0  0  0  0  0 );
    }

    transport
    {
        muCoeffs<8>           ( 0.0009556  0  0  0  0  0  0  0 );
        kappaCoeffs<8>        ( 0.605   0  0  0  0  0  0  0 );
    }
}


// ************************************************************************* //


