cases/GE_3x3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application              subChannelFoamSinglePhase;

startFrom                startTime;

startTime                0;

stopAt                   endTime;

endTime                  10;

deltaT                   0.01;

writeControl             runTime;

writeInterval            0.2;

purgeWrite               0;

writeFormat              ascii;

writePrecision           6;

writeCompression         off;

timeFormat               general;

timePrecision            6;

runTimeModifiable        yes;

adjustTimeStep           no;

maxCo                    5;

libs ("libmixingConvectionScheme.so");

// ************************************************************************* //


