cases/GE_3x3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration           true;
        nCellsInCoarsestLevel        10;
        agglomerator                 faceAreaPair;
        mergeLevels                  1;
    }

    pFinal
    {
        $p             ;
        relTol        0;
    }

    "(U|k|epsilon|h.liquid)"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-05;
        relTol           0.1;
    }

    "(U|k|epsilon|h.liquid)Final"
    {
        $U             ;
        relTol        0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors        0;
    nCorrectors                     2;
}


// ************************************************************************* //


